#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
Acquiring state lock. This may take a few moments...
module.ssh-key.random_pet.ssh_key_name: Refreshing state... [id=sshfancywallaby]
data.azurerm_client_config.current: Reading...
module.resource-group.azurerm_resource_group.rg: Refreshing state... [id=/subscriptions/46b2dfbe-fe9e-4433-b327-b2dc32c8af5e/resourceGroups/rg-freundcloudaks]
data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD0yZmRiMjUyNy0zYTEyLTRiMjgtOGI1Mi05M2ExOGUwNjdhYWQ7b2JqZWN0SWQ9ODkzZmQ5ZDgtM2U1OC00ZWJhLTg3MGItMGI4Mzc1MzgxMTU2O3N1YnNjcmlwdGlvbklkPTQ2YjJkZmJlLWZlOWUtNDQzMy1iMzI3LWIyZGMzMmM4YWY1ZTt0ZW5hbnRJZD0wNDhhYWZjYi0xYjVhLTRkYTgtODAyZS01YTNmN2Y1MzA1MjE=]
module.am-dce.azurerm_monitor_data_collection_endpoint.dce: Refreshing state... [id=/subscriptions/46b2dfbe-fe9e-4433-b327-b2dc32c8af5e/resourceGroups/rg-freundcloudaks/providers/Microsoft.Insights/dataCollectionEndpoints/MSProm-uksouth-freundcloudaks]
module.user_assigned_identity.azurerm_user_assigned_identity.msi: Refreshing state... [id=/subscriptions/46b2dfbe-fe9e-4433-b327-b2dc32c8af5e/resourceGroups/rg-freundcloudaks/providers/Microsoft.ManagedIdentity/userAssignedIdentities/uai-olafkfreund-dev]
module.ssh-key.azapi_resource.ssh_public_key: Refreshing state... [id=/subscriptions/46b2dfbe-fe9e-4433-b327-b2dc32c8af5e/resourceGroups/rg-freundcloudaks/providers/Microsoft.Compute/sshPublicKeys/sshfancywallaby]
module.azure-monitor-workspace.azurerm_monitor_workspace.workspace: Refreshing state... [id=/subscriptions/46b2dfbe-fe9e-4433-b327-b2dc32c8af5e/resourceGroups/rg-freundcloudaks/providers/Microsoft.Monitor/accounts/dev-amw-freundcloudaks]
module.managed-grafana.azurerm_dashboard_grafana.grafana: Refreshing state... [id=/subscriptions/46b2dfbe-fe9e-4433-b327-b2dc32c8af5e/resourceGroups/rg-freundcloudaks/providers/Microsoft.Dashboard/grafana/dev-grafana-fcaks]
module.am-dcr.azurerm_monitor_data_collection_rule.dcr: Refreshing state... [id=/subscriptions/46b2dfbe-fe9e-4433-b327-b2dc32c8af5e/resourceGroups/rg-freundcloudaks/providers/Microsoft.Insights/dataCollectionRules/MSProm-uksouth-freundcloudaks]
module.network_contributor_role.azurerm_role_assignment.role: Refreshing state... [id=/subscriptions/46b2dfbe-fe9e-4433-b327-b2dc32c8af5e/resourceGroups/rg-freundcloudaks/providers/Microsoft.Authorization/roleAssignments/05132448-6c2f-51dd-9b13-fca2d7083c48]
module.acr.azurerm_container_registry.acr: Refreshing state... [id=/subscriptions/46b2dfbe-fe9e-4433-b327-b2dc32c8af5e/resourceGroups/rg-freundcloudaks/providers/Microsoft.ContainerRegistry/registries/devfcacr]
module.ssh-key.azapi_resource_action.ssh_public_key_gen: Refreshing state... [id=/subscriptions/46b2dfbe-fe9e-4433-b327-b2dc32c8af5e/resourceGroups/rg-freundcloudaks/providers/Microsoft.Compute/sshPublicKeys/sshfancywallaby/generateKeyPair]
module.aks.azurerm_kubernetes_cluster.aks: Refreshing state... [id=/subscriptions/46b2dfbe-fe9e-4433-b327-b2dc32c8af5e/resourceGroups/rg-freundcloudaks/providers/Microsoft.ContainerService/managedClusters/freundcloudaks]
module.monitoring_data_reader_role.azurerm_role_assignment.role: Refreshing state... [id=/subscriptions/46b2dfbe-fe9e-4433-b327-b2dc32c8af5e/resourceGroups/rg-freundcloudaks/providers/Microsoft.Monitor/accounts/dev-amw-freundcloudaks/providers/Microsoft.Authorization/roleAssignments/1070c15c-fe9c-bdfa-d6e9-4948f8150df5]
module.acr_pull_role.azurerm_role_assignment.role: Refreshing state... [id=/subscriptions/46b2dfbe-fe9e-4433-b327-b2dc32c8af5e/resourceGroups/rg-freundcloudaks/providers/Microsoft.ContainerRegistry/registries/devfcacr/providers/Microsoft.Authorization/roleAssignments/44d4706b-f533-b226-43f8-6b180812bf43]
module.am-dcr.azurerm_monitor_data_collection_rule_association.dcra: Refreshing state... [id=/subscriptions/46b2dfbe-fe9e-4433-b327-b2dc32c8af5e/resourceGroups/rg-freundcloudaks/providers/Microsoft.ContainerService/managedClusters/freundcloudaks/providers/Microsoft.Insights/dataCollectionRuleAssociations/dcra-dcr-prometheus-aks]
module.dapr-extension.azurerm_kubernetes_cluster_extension.ext: Refreshing state... [id=/subscriptions/46b2dfbe-fe9e-4433-b327-b2dc32c8af5e/resourceGroups/rg-freundcloudaks/providers/Microsoft.ContainerService/managedClusters/freundcloudaks/providers/Microsoft.KubernetesConfiguration/extensions/dapr]
module.rule-groups.azurerm_monitor_alert_prometheus_rule_group.node_recording_rules_rule_group: Refreshing state... [id=/subscriptions/46b2dfbe-fe9e-4433-b327-b2dc32c8af5e/resourceGroups/rg-freundcloudaks/providers/Microsoft.AlertsManagement/prometheusRuleGroups/NodeRecordingRulesRuleGroup-freundcloudaks]
module.rule-groups.azurerm_monitor_alert_prometheus_rule_group.kubernetes_recording_rules_rule_group: Refreshing state... [id=/subscriptions/46b2dfbe-fe9e-4433-b327-b2dc32c8af5e/resourceGroups/rg-freundcloudaks/providers/Microsoft.AlertsManagement/prometheusRuleGroups/KubernetesRecordingRulesRuleGroup-freundcloudaks]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.aks.azurerm_kubernetes_cluster.aks will be updated in-place
  ~ resource "azurerm_kubernetes_cluster" "aks" {
        id                                  = "/subscriptions/46b2dfbe-fe9e-4433-b327-b2dc32c8af5e/resourceGroups/rg-freundcloudaks/providers/Microsoft.ContainerService/managedClusters/freundcloudaks"
        name                                = "freundcloudaks"
        tags                                = {
            "application" = "freundcloudaks"
            "environment" = "dev"
            "owner"       = "olafkfreund"
        }
        # (40 unchanged attributes hidden)

      ~ default_node_pool {
            name                          = "default"
            tags                          = {}
            # (33 unchanged attributes hidden)

          - upgrade_settings {
              - drain_timeout_in_minutes      = 0 -> null
              - max_surge                     = "10%" -> null
              - node_soak_duration_in_minutes = 0 -> null
            }
        }

        # (7 unchanged blocks hidden)
    }

  # module.grafana_admin_role.azurerm_role_assignment.role will be created
  + resource "azurerm_role_assignment" "role" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_type                   = "User"
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Grafana Admin"
      + scope                            = "/subscriptions/46b2dfbe-fe9e-4433-b327-b2dc32c8af5e/resourceGroups/rg-freundcloudaks/providers/Microsoft.Dashboard/grafana/dev-grafana-fcaks"
      + skip_service_principal_aad_check = (known after apply)
        # (1 unchanged attribute hidden)
    }

Plan: 1 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: main.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "main.tfplan"
Releasing state lock. This may take a few moments...

```

</details>

*Pushed by: @olafkfreund, Action: `pull_request`*